/*/*
								заголовочный файл (с расширением .h)
							-----------информация о библиотеке----------------
  NEWrusCharsI2C.h - библиотека для вывода руссикх символов (и не только) на экран типа LCD 1620  по интерфейсу I2C
*/


//проверка, что библиотека еще не подключена
#ifndef NEWrusCharsI2C_h		// если библиотека не подключена
#define NEWrusCharsI2C_h		// тогда подключаем её

#include <Arduino.h>		// в библиотеках нужно явно подключить Arduino.h

///Объявляем класс
class MoreRusCharsClassI2C
{
	public:
		MoreRusCharsClassI2C(); ///Описание класса
		uint8_t NewChar101[8]= {B11110,B10000,B10000,B11110,B10001,B10001,B11110,B00000,};		///константа с буквой "Б"
		uint8_t NewChar102[8]= {B11111,B10001,B10000,B10000,B10000,B10000,B10000,B00000,};		///константа с буквой "Г"
		uint8_t NewChar103[8]= {B01111,B00101,B00101,B01001,B10001,B11111,B10001,B00000,}; 		///константа с буквой "Д"
		uint8_t NewChar104[8]= {B01010,B11111,B10000,B11111,B10000,B10000,B11111,B00000,}; 		///константа с буквой "Ё"
		uint8_t NewChar105[8]= {B10101,B10101,B10101,B11111,B10101,B10101,B10101,B00000,}; 		///константа с буквой "Ж"
		uint8_t NewChar106[8]= {B01110,B10001,B00001,B00010,B00001,B10001,B01110,B00000,}; 		///константа с буквой "З"
		uint8_t NewChar107[8]= {B10001,B10011,B10011,B10101,B11001,B11001,B10001,B00000,}; 		///константа с буквой "И"
		uint8_t NewChar108[8]= {B01110,B00000,B10001,B10011,B10101,B11001,B10001,B00000,}; 		///константа с буквой "Й"
		uint8_t NewChar109[8]= {B00011,B00111,B00101,B00101,B01101,B01001,B11001,B00000,}; 		///константа с буквой "Л"
		uint8_t NewChar110[8]= {B11111,B10001,B10001,B10001,B10001,B10001,B10001,B00000,}; 		///константа с буквой "П"
		uint8_t NewChar111[8]= {B10001,B10001,B10001,B01010,B00100,B01000,B10000,B00000,}; 		///константа с буквой "У"
		uint8_t NewChar112[8]= {B00100,B11111,B10101,B10101,B11111,B00100,B00100,B00000,}; 		///константа с буквой "Ф"
		uint8_t NewChar113[8]= {B10010,B10010,B10010,B10010,B10010,B10010,B11111,B00001,}; 		///константа с буквой "Ц"
		uint8_t NewChar114[8]= {B10001,B10001,B10001,B01111,B00001,B00001,B00001,B00000,}; 		///константа с буквой "Ч"
		uint8_t NewChar115[8]= {B10101,B10101,B10101,B10101,B10101,B10101,B11111,B00000,}; 		///константа с буквой "Ш"
		uint8_t NewChar116[8]= {B10101,B10101,B10101,B10101,B10101,B10101,B11111,B00001,}; 		///константа с буквой "Щ"
		uint8_t NewChar117[8]= {B10000,B10000,B10000,B11110,B10001,B10001,B11110,B00000,}; 		///константа с буквой "Ь"
		uint8_t NewChar118[8]= {B10001,B10001,B10001,B11001,B10101,B10101,B11001,B00000,}; 		///константа с буквой "Ы"
		uint8_t NewChar119[8]= {B11000,B01000,B01000,B01110,B01001,B01001,B01110,B00000,}; 		///константа с буквой "Ъ"
		uint8_t NewChar120[8]= {B01110,B10001,B00001,B00111,B00001,B10001,B01110,B00000,}; 		///константа с буквой "Э"
		uint8_t NewChar121[8]= {B10010,B10101,B10101,B11101,B10101,B10101,B10010,B00000,}; 		///константа с буквой "Ю"
		uint8_t NewChar122[8]= {B01111,B10001,B10001,B01111,B00101,B01001,B10001,B00000,}; 		///константа с буквой "Я"
		uint8_t NewChar123[8]= {B00000,B01010,B11111,B11111,B11111,B01110,B00100,B00000,}; 		///константа с ♥
		uint8_t NewChar124[8]= {B00000,B00100,B01110,B11111,B01110,B01010,B01110,B00000,};		///константа с ⌂
		uint8_t NewChar125[8]= {B01000,B00100,B00110,B01110,B10111,B10111,B10111,B01110,};		///константа с `O
		uint8_t NewChar126[8]= {B00000,B00100,B10101,B01110,B01110,B10101,B00100,B00000,};		///константа с ☼
		uint8_t NewChar127[8]= {B01100,B10010,B10010,B01100,B00000,B00000,B00000,B00000,};		///константа с °
/*		uint8_t NewChar128[8]; ///константа с буквой
		uint8_t NewChar129[8]; ///константа с буквой
		uint8_t NewChar130[8]; ///константа с буквой
*/
};

#endif